email_webhook_app/app/controllers/data_controller.rb

INSERT INTO "data" ("address", "event", "email_type", "timestamp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    if request.headers['Content-Type'] == 'text/json'
      data = JSON.parse(request.body.read)
      @datum = Datum.create(
                  address: data['Address'],
                  email_type: data['EmailType'],
                  event: data['Event'],
                  timestamp: Time.at(data['Timestamp'])
                  )